["```py\nprompt_template_beggining = \"\"\"\nYou are an expert compliance analyst.\nYour task is to extract information from the sign up forms obtained.\n1\\. Carefully analyze the document provided as context.\n2\\. Write an intro paragraph for the company so the senior compliance analyst can quickly understand who the customer is.\n3\\. Following the guidance for approved businesses add a paragraph after the intro explaining why the business is supportable or not.\n4\\. Add another paragraph below explaining where the company is.\n5\\. Always think step by step.\n<supportable_businesses>\nSummary of Prohibited & Restricted Businesses\nThis document outlines the types of businesses and activities that are generally not allowed or require prior approval to use payment processing services. These restrictions exist due to legal requirements, financial partner rules, and compliance and risk management policies of payment processors.\nTypes of Businesses:\nHigh-Risk Jurisdictions and Persons: Businesses operating in or dealing with sanctioned countries and individuals.\nProhibited Businesses: Activities involving illegal products or services, adult content, certain financial services, marijuana, unfair practices, weapons, etc.\nRestricted Businesses: Activities requiring prior written approval from the payment processor, such as CBD, financial products, pharmaceuticals, non-fiat currency, and more.\nJurisdiction-Specific Prohibited Businesses: Additional restrictions based on specific countries, such as India, Japan, Malaysia, Mexico, Singapore, Thailand, UAE, and the US.\nProhibited Uses of Payment Processing Services:\nMisrepresentation of identity or business.\nFacilitating transactions for undisclosed merchants.\nUsing the service as a virtual terminal.\nProcessing without actual goods or services.\nEvasion of chargeback monitoring.\nSharing cardholder information.\nMisuse of intellectual property.\nProhibitions for Card Issuing Products:\nConsumer use for personal expenses.\nInternational use outside of the registered jurisdiction.\nLending without proper licensing and approval.\nAbusive practices like free trial abuse and scalping.\nNon-compliance with marketing and user experience guidelines.\nInactivity for 12 consecutive months.\nIncorrect integration type for employee/contractor cards.\nBusiness Analyst Recommendations:\nBased on this information, a business analyst should pay close attention to the following types of businesses:\nFinancial Services: This is a broad category with many restrictions and nuances. It's crucial to understand the specific requirements for lending, crowdfunding, money transmission, etc.\nRegulated Industries: Industries like CBD, pharmaceuticals, and tobacco require careful consideration of compliance and legal aspects.\nHigh-Risk Businesses: Businesses prone to fraud or abuse, like travel reservation services and multi-level marketing, need thorough risk assessments.\nEmerging Technologies: Activities involving cryptocurrency, NFTs, and other new technologies should be evaluated based on current regulations and the payment processor's policies.\nJurisdiction-Specific Restrictions: Businesses operating in or targeting specific countries need to be aware of additional prohibitions and requirements.\nAdditional Considerations:\nBusiness Model: Restrictions often depend on the specific business model and how the service is used.\nCompliance: Understanding and adhering to relevant regulations is essential to avoid account closure or other consequences.\nRisk Management: Businesses should have robust risk management practices to mitigate potential financial and legal risks.\nTransparency: Maintaining clear and accurate information about the business and its activities is crucial for approval and continued use of payment processing services.\nBy carefully considering these factors, a business analyst can help ensure that businesses comply with the payment processor's policies and operate successfully within the platform.\n</supportable_businesses>\n<document>\n\"\"\"\nprompt_template_end=\"\"\"\n</document>\nResponse:\n\"\"\" \n```", "```py\ntext content. This can be further customized to evaluate safety attributes, for example, or to deal with empty results. For example, in the case of empty results, you could flag the doc and send it to a queue for further processing.\n```", "```py\nimport time\nsummaries = []\nfor doc in docs:\n  result = generate(prompt_template_beggining,str(doc),prompt_template_end)\n  #sleep 10 seconds to not exceed 6 QPM\n  time.sleep(10)\n  summaries.append(result.text)\n  print(result.text) \n```"]