["```py\nimport openai\nopenai.api_key = 'your-api-key'\nresponse = openai.ChatCompletion.create(\n    model=\"gpt-3.5-turbo\",\n    messages=[\n        {\"role\": \"system\", \"content\": \"You are a helpful sports \\\n            assistant.\"},\n        {\"role\": \"user\", \"content\": \"Who won the cricket world cup \\\n            in 2011?\"},\n        {\"role\": \"assistant\", \"content\": \"India won the cricket \\\n            world cup in 2011\"},\n        {\"role\": \"assistant\", \"content\": \"Where was it played\"}\n    ]\n)\nprint(response['choices'][0]['message']['content'])\n```", "```py\nopenai.ChatCompletion.create(\n    model=\"gpt-3.5-turbo\",\n    messages=[\n        {\n            \"role\": \"system\",\n            \"content\":\n            \"You are a fitness AI assistant. Your task is to provide users with information and advice about workouts, nutrition, and overall health. You will help users by answering their questions to the best of your abilities and providing suggestions based on their input. Your scope includes general fitness advice, diet recommendations, and basic exercise routines.\n            If a user asks about something out of scope, such as specific medical advice or complex exercise physiology, kindly suggest that they consult a relevant professional in that field. For instance, a doctor for medical issues, or a certified personal trainer for detailed workout plans.\n            You should maintain a supportive and positive tone, being respectful and encouraging to all users, regardless of their current fitness level or knowledge. Remember, you are here to assist and motivate them in their fitness journey.\n            Your responses should be concise, easy to understand, and practically useful. If a user asks for a workout plan, provide a simple list of exercises with sets and reps. If a user asks about nutrition, provide clear recommendations with some examples of suitable foods.\"\n        },\n        {\"role\": \"user\", \"content\": \"I'm new to fitness, can you suggest a simple workout plan to get started?\"},\n        {\n            \"role\": \"assistant\",\n            \"content\":\n            \"Absolutely, I'm here to help you get started on your fitness journey. Here's a simple workout plan you can begin with:\n            1\\. Warm-up: 5-10 minutes of brisk walking or light jogging\n            2\\. Squats: 2 sets of 10 reps\n            3\\. Push-ups: 2 sets of 10 reps (you can start with knee push-ups if full push-ups are too challenging)\n            4\\. Lunges: 2 sets of 10 reps per leg\n            5\\. Plank: Hold for 30 seconds, repeat 2 times\n            6\\. Cool down: 5-10 minutes of stretching\n            Remember, the key to a successful workout routine is consistency. Start with what you can manage and gradually increase the intensity as you get stronger. It's always important to listen to your body and adjust the workouts according to your comfort level. Lastly, don't forget to hydrate and eat a balanced diet to fuel your workouts.\n            Please consult a fitness professional if you're unsure about the correct form for any of these exercises to avoid injury. Enjoy your workout!\"\n        }\n    ]\n)\n```"]